dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxSdmmc_regdef.h
/** \brief Software Reset Register   */
typedef union
{
    Ifx_UReg_8Bit U;                  /**< \brief Unsigned access */
    Ifx_SReg_8Bit I;                  /**< \brief Signed access */
    Ifx_SDMMC_SW_RST_Bits B;          /**< \brief Bitfield access */
} Ifx_SDMMC_SW_RST;

/** \brief Timeout Control Register   */
typedef union
{
    Ifx_UReg_8Bit U;                  /**< \brief Unsigned access */
    Ifx_SReg_8Bit I;                  /**< \brief Signed access */
    Ifx_SDMMC_TOUT_CTRL_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_TOUT_CTRL;

/** \brief Wakeup Control Register   */
typedef union
{
    Ifx_UReg_8Bit U;                  /**< \brief Unsigned access */
    Ifx_SReg_8Bit I;                  /**< \brief Signed access */
    Ifx_SDMMC_WUP_CTRL_Bits B;        /**< \brief Bitfield access */
} Ifx_SDMMC_WUP_CTRL;

/** \brief Transfer Mode register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_XFER_MODE_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_XFER_MODE;

/** \}  */

/******************************************************************************/
/** \addtogroup IfxSfr_Sdmmc_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief SDMMC object */
typedef volatile struct _Ifx_SDMMC
{
       Ifx_SDMMC_SDMASA                    SDMASA;                 /**< \brief 0, SDMA System Address register*/
       Ifx_SDMMC_BLOCKSIZE                 BLOCKSIZE;              /**< \brief 4, Block Size register*/
       Ifx_SDMMC_BLOCKCOUNT                BLOCKCOUNT;             /**< \brief 6, 16-bit Block Count register*/
       Ifx_SDMMC_ARGUMENT                  ARGUMENT;               /**< \brief 8, Argument register*/
       Ifx_SDMMC_XFER_MODE                 XFER_MODE;              /**< \brief C, Transfer Mode register*/
       Ifx_SDMMC_CMD                       CMD;                    /**< \brief E, Command register*/
       Ifx_SDMMC_RESP01                    RESP01;                 /**< \brief 10, Response Register 01*/
       Ifx_SDMMC_RESP23                    RESP23;                 /**< \brief 14, Response Register 23*/
       Ifx_SDMMC_RESP45                    RESP45;                 /**< \brief 18, Response Register 45*/
       Ifx_SDMMC_RESP67                    RESP67;                 /**< \brief 1C, Response Register 67*/
       Ifx_SDMMC_BUF_DATA                  BUF_DATA;               /**< \brief 20, Buffer Data Port Register*/
       Ifx_SDMMC_PSTATE_REG                PSTATE_REG;             /**< \brief 24, Present State Register*/
       Ifx_SDMMC_HOST_CTRL1                HOST_CTRL1;             /**< \brief 28, Host Control 1 Register*/
       Ifx_SDMMC_PWR_CTRL                  PWR_CTRL;               /**< \brief 29, Power Control Register*/
       Ifx_SDMMC_BGAP_CTRL                 BGAP_CTRL;              /**< \brief 2A, Block Gap Control Register*/
       Ifx_SDMMC_WUP_CTRL                  WUP_CTRL;               /**< \brief 2B, Wakeup Control Register*/
       Ifx_SDMMC_CLK_CTRL                  CLK_CTRL;               /**< \brief 2C, Clock Control Register*/
       Ifx_SDMMC_TOUT_CTRL                 TOUT_CTRL;              /**< \brief 2E, Timeout Control Register*/
       Ifx_SDMMC_SW_RST                    SW_RST;                 /**< \brief 2F, Software Reset Register*/
       Ifx_SDMMC_NORMAL_INT_STAT           NORMAL_INT_STAT;        /**< \brief 30, Normal Interrupt Status Register*/
       Ifx_SDMMC_ERROR_INT_STAT            ERROR_INT_STAT;         /**< \brief 32, Error Interrupt Status Register*/
       Ifx_SDMMC_NORMAL_INT_STAT_EN        NORMAL_INT_STAT_EN;     /**< \brief 34, Normal Interrupt Status Enable Register*/
       Ifx_SDMMC_ERROR_INT_STAT_EN         ERROR_INT_STAT_EN;      /**< \brief 36, Error Interrupt Status Enable Register*/
       Ifx_SDMMC_NORMAL_INT_SIGNAL_EN      NORMAL_INT_SIGNAL_EN;    /**< \brief 38, Normal Interrupt Signal Enable Register*/
       Ifx_SDMMC_ERROR_INT_SIGNAL_EN       ERROR_INT_SIGNAL_EN;    /**< \brief 3A, Error Interrupt Signal Enable Register*/
       Ifx_SDMMC_AUTO_CMD_STAT             AUTO_CMD_STAT;          /**< \brief 3C, Auto CMD Status Register*/
       Ifx_SDMMC_HOST_CTRL2                HOST_CTRL2;             /**< \brief 3E, Host Control 2 Register*/
       Ifx_SDMMC_CAPABILITIES1             CAPABILITIES1;          /**< \brief 40, Capabilities 1 Register 0 to 31*/
       Ifx_SDMMC_CAPABILITIES2             CAPABILITIES2;          /**< \brief 44, Capabilities Register 32 to 63*/
       Ifx_SDMMC_CURR_CAPABILITIES1        CURR_CAPABILITIES1;     /**< \brief 48, Maximum Current Capabilities Register 0 to 31*/
       Ifx_SDMMC_CURR_CAPABILITIES2        CURR_CAPABILITIES2;     /**< \brief 4C, Maximum Current Capabilities Register 32 to 63*/
       Ifx_SDMMC_FORCE_AUTO_CMD_STAT       FORCE_AUTO_CMD_STAT;    /**< \brief 50, Force Event Register for Auto CMD Error Status register*/
       Ifx_SDMMC_FORCE_ERROR_INT_STAT      FORCE_ERROR_INT_STAT;    /**< \brief 52, Force Event Register for Error Interrupt Status*/
       Ifx_SDMMC_ADMA_ERR_STAT             ADMA_ERR_STAT;          /**< \brief 54, ADMA Error Status Register*/
       Ifx_SDMMC_ADMA_SA_LOW               ADMA_SA_LOW;            /**< \brief 58, ADMA System Address Register Low*/
       Ifx_UReg_8Bit                       reserved_5C[4];         /**< \brief 5C, \internal Reserved */
       Ifx_SDMMC_PRESET_INIT               PRESET_INIT;            /**< \brief 60, Preset Value for Initialization*/
       Ifx_SDMMC_PRESET_DS                 PRESET_DS;              /**< \brief 62, Preset Value for Default Speed*/
       Ifx_SDMMC_PRESET_HS                 PRESET_HS;              /**< \brief 64, Preset Value for High Speed*/
       Ifx_UReg_8Bit                       reserved_68[16];        /**< \brief 68, \internal Reserved */
       Ifx_SDMMC_ADMA_ID_LOW               ADMA_ID_LOW;            /**< \brief 78, ADMA3 Integrated Descriptor Address Register - Low*/
       Ifx_UReg_8Bit                       reserved_7C[108];       /**< \brief 7C, \internal Reserved */
       Ifx_SDMMC_P_VENDOR_SPECIFIC_AREA    P_VENDOR_SPECIFIC_AREA;    /**< \brief E8, Pointer for Vendor Specific Area 1*/
       Ifx_SDMMC_P_VENDOR2_SPECIFIC_AREA   P_VENDOR2_SPECIFIC_AREA;    /**< \brief EA, Pointer for Vendor Specific Area 2*/
       Ifx_UReg_8Bit                       reserved_EC[16];        /**< \brief EC, \internal Reserved */
       Ifx_SDMMC_SLOT_INTR_STATUS          SLOT_INTR_STATUS;       /**< \brief FC, Slot Interrupt Status Register*/
       Ifx_SDMMC_HOST_CNTRL_VERS           HOST_CNTRL_VERS;        /**< \brief FE, Host Controller Version*/
       Ifx_UReg_8Bit                       reserved_100[128];      /**< \brief 100, \internal Reserved */
       Ifx_SDMMC_MSHC_VER_ID               MSHC_VER_ID;            /**< \brief 180, MSHC version*/
       Ifx_SDMMC_MSHC_VER_TYPE             MSHC_VER_TYPE;          /**< \brief 184, MSHC version type*/
       Ifx_UReg_8Bit                       reserved_188[8];        /**< \brief 188, \internal Reserved */
       Ifx_SDMMC_MBIU_CTRL                 MBIU_CTRL;              /**< \brief 190, DMA burst control register*/
       Ifx_UReg_8Bit                       reserved_194[24];       /**< \brief 194, \internal Reserved */
       Ifx_SDMMC_EMMC_CTRL                 EMMC_CTRL;              /**< \brief 1AC, eMMC Control register*/
       Ifx_SDMMC_BOOT_CTRL                 BOOT_CTRL;              /**< \brief 1AE, eMMC Boot Control register*/
       Ifx_UReg_8Bit                       reserved_1B0[208];      /**< \brief 1B0, \internal Reserved */
       Ifx_SDMMC_EMBEDDED_CTRL             EMBEDDED_CTRL;          /**< \brief 280, Embedded Control register*/
       Ifx_UReg_8Bit                       reserved_284[124];      /**< \brief 284, \internal Reserved */
       Ifx_SDMMC_CLC                       CLC;                    /**< \brief 300, Clock Control Register*/
       Ifx_SDMMC_ID                        ID;                     /**< \brief 304, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_308[4];        /**< \brief 308, \internal Reserved */
       Ifx_SDMMC_ACCEN0                    ACCEN0;                 /**< \brief 30C, Access Enable Register 0*/
       Ifx_SDMMC_ACCEN1                    ACCEN1;                 /**< \brief 310, Access Enable Register 1*/
       Ifx_SDMMC_KRST0                     KRST0;                  /**< \brief 314, Kernel Reset Register 0*/
       Ifx_SDMMC_KRST1                     KRST1;                  /**< \brief 318, Kernel Reset Register 1*/
       Ifx_SDMMC_KRSTCLR                   KRSTCLR;                /**< \brief 31C, Kernel Reset Status Clear Register*/
       Ifx_UReg_8Bit                       reserved_320[3295];     /**< \brief 320, \internal Reserved */
} Ifx_SDMMC;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXSDMMC_REGDEF_H */
